app/views/questions/index.html.erb

    <% @questions.each do |question| %>
    <h3><%= link_to question.title, show_question_path(question) %> - asked by <a href="/users/<%= question.user_id %>"><%= User.find(question.user_id).username %></a></h3>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]