app/views/questions/show.html.erb

			<div class="col-xs-12">
				<h5>Answer by: <a href="/users/<%= answer.user_id %>"><%= User.find(answer.user_id).username.capitalize %></a></h5>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]