StackTooDeep/app/controllers/answers_controller.rb

	def create
		Answer.create(body: params[:answer][:body])
---
INSERT INTO "answers" ("body", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["body", "dxvdxds"], ["created_at", "2014-10-10 23:30:01.147025"], ["updated_at", "2014-10-10 23:30:01.147025"]]