StackTooDeep/app/controllers/question_controller.rb

	def show
		@answer = Answer.new
		@answers = Answer.all.order('vote_count DESC')
---
SELECT "answers".* FROM "answers"   ORDER BY vote_count	 DESC