app/controllers/answers_controller.rb

INSERT INTO "answers" ("body", "created_at", "question_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "sdcdcds"], ["created_at", "2014-10-12 21:11:43.083312"], ["question_id", 1], ["updated_at", "2014-10-12 21:11:43.083312"], ["user_id", 2]]
---
	def create
		Answer.create(answer_params)

SELECT  "answers".* FROM "answers"  WHERE "answers"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "answers" SET "updated_at" = $1, "vote_count" = $2 WHERE "answers"."id" = 2  [["updated_at", "2014-10-13 02:16:33.041148"], ["vote_count", -1]]
---
	def vote
		@answer = Answer.find(params[:answer_id])
		@vote_value = params[:vote_value].to_i
		@answer.update(vote_count: @answer.vote_count + @vote_value)