app/controllers/questions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" IS NULL LIMIT 1
SELECT "questions".* FROM "questions"   ORDER BY created_at DESC
---
  def index
    @user = User.find_by(email: params[:email])
    @question = Question.new
    @questions = Question.all

INSERT INTO "questions" ("body", "created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "sdfjhsdjf"], ["created_at", "2014-10-12 06:55:54.825154"], ["title", "attempt 4"], ["updated_at", "2014-10-12 06:55:54.825154"], ["user_id", 3]]
---
  def create
    Question.create(question_params)

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "answers".* FROM "answers"  WHERE "answers"."question_id" = 1  ORDER BY vote_count DESC
---
  def show
    @question = Question.find(params[:id])
    @answer = Answer.new
    @answers = Answer.all.order('vote_count DESC')