app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "username") VALUES ($1, $2, $3) RETURNING "id"  [["email", "dsjlkjf"], ["password_digest", "$2a$10$eMIrhY6yg0Wyuokn1RtVk.FY6LS53hbq5ZHjwhtK5ZUmwARBrI4Gy"], ["username", "tester"]]
---
  def create
    @user = User.new(params.require(:user).permit(:username, :email, :password))
    if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 0]]
SELECT "questions".* FROM "questions"  WHERE "questions"."user_id" = 3
---
  def show
    @user = User.find(params[:id])
    @question = Question.all